ycsb-results/mongodb/a/rc150-op100/tc4/run5.txt
/usr/bin/java  -classpath /home/atz2nd/Desktop/editycsb/YCSB/conf:/home/atz2nd/Desktop/editycsb/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/atz2nd/Desktop/editycsb/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://127.0.0.1:27017 -P /home/atz2nd/Desktop/editycsb/YCSB/workloads/workloada -p recordcount=150 -threads 4 -p operationcount=100
mongo client connection created with mongodb://127.0.0.1:27017
[OVERALL], RunTime(ms), 504
[OVERALL], Throughput(ops/sec), 198.4126984126984
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 4
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7936507936507936
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 4
[TOTAL_GC_TIME_%], Time(%), 0.7936507936507936
[READ], Operations, 55
[READ], AverageLatency(us), 3235.6545454545453
[READ], MinLatency(us), 863
[READ], MaxLatency(us), 52959
[READ], 95thPercentileLatency(us), 4267
[READ], 99thPercentileLatency(us), 52959
[READ], Return=OK, 55
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 528.5
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2109
[CLEANUP], 95thPercentileLatency(us), 2109
[CLEANUP], 99thPercentileLatency(us), 2109
[UPDATE], Operations, 45
[UPDATE], AverageLatency(us), 3272.822222222222
[UPDATE], MinLatency(us), 630
[UPDATE], MaxLatency(us), 52031
[UPDATE], 95thPercentileLatency(us), 1479
[UPDATE], 99thPercentileLatency(us), 52031
[UPDATE], Return=OK, 45